Revit 2027 API
SizingCalculator.CalculateSizeByVelocity Method
 Calculates the duct or pipe size based on the specified flow and velocity.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void CalculateSizeByVelocity(
	double flow,
	double velocity,
	SizingOptions sizingOptions
)
Public Sub CalculateSizeByVelocity (
	flow As Double,
	velocity As Double,
	sizingOptions As SizingOptions
)
public:
void CalculateSizeByVelocity(
	double flow,
	double velocity,
	SizingOptions^ sizingOptions
)
member CalculateSizeByVelocity :
        flow : float *
        velocity : float *
        sizingOptions : SizingOptions -> unit
Parameters
flow Double
 The flow rate.
velocity Double
 The desired velocity.
sizingOptions SizingOptions
 The sizing options containing other input sizing parameters (such as density, viscosity, roughness, etc.) and output sizes.
Exceptions
Exception | Condition
ArgumentException |  The input must be initialized correctly for sizing operation.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for flow must be positive. -or- The given value for velocity must be positive.
InvalidOperationException |  Failed to calculate the size to satisfy the velocity constraint.
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace